status/2022/0729.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-06 Sat 06:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>23 July 2022 - 29 July 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">23 July 2022 - 29 July 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2c97fe1">1. MIT OCW</a>
<ul>
<li><a href="#orgc73b765">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#org604f38c">1.1.1. PS9 con't.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgece9faf">2. Emergency Crystal Radio</a>
<ul>
<li><a href="#org81bef18">2.1. Broke inductor selector - oops. Fix/replace?</a></li>
</ul>
</li>
<li><a href="#orged7a522">3. Mill Controller #2</a>
<ul>
<li><a href="#org92360fd">3.1. Try Alpine Linux</a></li>
<li><a href="#org7c965a5">3.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#org25718f6">3.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#org0952bee">3.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgaec4907">4. Alum Rock Data Center</a>
<ul>
<li><a href="#org3197f54">4.1. Using CentOS 7 for now - good until 2024?</a></li>
<li><a href="#org8acf89c">4.2. need to check alma, rocky, others? for suitability</a></li>
</ul>
</li>
<li><a href="#org8a1055b">5. OLPC</a>
<ul>
<li><a href="#org50653fa">5.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#orgd973ce7">6. Virtual Orchestra</a>
<ul>
<li><a href="#org1bff023">6.1. sfz file tests</a>
<ul>
<li><a href="#org6e8dfee">6.1.1. Started new audio tool program to replace aftools</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2c136d5">7. i5 system</a>
<ul>
<li><a href="#orgd32c1bf">7.1. delicate primes</a>
<ul>
<li><a href="#org1989bc1">7.1.1. Verified 294001 is a delicate prime in base 10</a></li>
<li><a href="#org4d59a53">7.1.2. Determined 294001 is delicate in bases 2 and 10 but not in bases 3-9,11-16</a></li>
<li><a href="#org5907dc3">7.1.3. What is the smallest delicate prime N in <b>any</b> base 2..(N-1)?</a></li>
</ul>
</li>
<li><a href="#org62a7845">7.2. i5-12600K CPU</a></li>
<li><a href="#org0421e5a">7.3. 32GB DDR5 mem</a></li>
<li><a href="#org6d20824">7.4. 512GB SSD</a></li>
<li><a href="#org89ae1d9">7.5. AMD Radeon RX 6800 GPU</a></li>
<li><a href="#orgac7eb57">7.6. ~100 compute cores across all devices</a></li>
</ul>
</li>
<li><a href="#org23ec361">8. More project ideas</a>
<ul>
<li><a href="#org97fa06c">8.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#org5cc6397">8.2. ENIAC simulation in verilog</a></li>
<li><a href="#org8241490">8.3. GMPForth ports to SIMH, DYCyber targets</a>
<ul>
<li><a href="#org0391d2a">8.3.1. SIMH maybe some targets (vax)</a></li>
<li><a href="#org197416b">8.3.2. DTCyber suboptimal due to data/addr word size mismatch</a></li>
<li><a href="#orgdd3502e">8.3.3. MAME looks interesting for microprocessor system emulations</a></li>
<li><a href="#orgadc3d03">8.3.4. Ports to classic figFORTH targets</a></li>
</ul>
</li>
<li><a href="#org4171f45">8.4. GMPASM assembler</a></li>
</ul>
</li>
<li><a href="#org32054c0">9. David Davies</a>
<ul>
<li><a href="#orgf4a8a75">9.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#orgd5acc80">9.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org1e46a7e">9.3. Next hearing 9/6/2022</a></li>
</ul>
</li>
<li><a href="#org12f40ee">10. Peter Kim</a>
<ul>
<li><a href="#orgd51df3b">10.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#org02ff282">10.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#orgb2f49ca">10.3. Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</a></li>
<li><a href="#org7a1f290">10.4. Sentencing 9/20/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2c97fe1" class="outline-2">
<h2 id="org2c97fe1"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc73b765" class="outline-3">
<h3 id="orgc73b765"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org604f38c" class="outline-4">
<h4 id="org604f38c"><span class="section-number-4">1.1.1.</span> PS9 con't.</h4>
</div>
</div>
</div>
<div id="outline-container-orgece9faf" class="outline-2">
<h2 id="orgece9faf"><span class="section-number-2">2.</span> Emergency Crystal Radio</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org81bef18" class="outline-3">
<h3 id="org81bef18"><span class="section-number-3">2.1.</span> Broke inductor selector - oops. Fix/replace?</h3>
</div>
</div>
<div id="outline-container-orged7a522" class="outline-2">
<h2 id="orged7a522"><span class="section-number-2">3.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org92360fd" class="outline-3">
<h3 id="org92360fd"><span class="section-number-3">3.1.</span> Try Alpine Linux</h3>
</div>
<div id="outline-container-org7c965a5" class="outline-3">
<h3 id="org7c965a5"><span class="section-number-3">3.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org25718f6" class="outline-4">
<h4 id="org25718f6"><span class="section-number-4">3.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-org0952bee" class="outline-4">
<h4 id="org0952bee"><span class="section-number-4">3.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgaec4907" class="outline-2">
<h2 id="orgaec4907"><span class="section-number-2">4.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org3197f54" class="outline-3">
<h3 id="org3197f54"><span class="section-number-3">4.1.</span> Using CentOS 7 for now - good until 2024?</h3>
</div>
<div id="outline-container-org8acf89c" class="outline-3">
<h3 id="org8acf89c"><span class="section-number-3">4.2.</span> need to check alma, rocky, others? for suitability</h3>
</div>
</div>
<div id="outline-container-org8a1055b" class="outline-2">
<h2 id="org8a1055b"><span class="section-number-2">5.</span> OLPC</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org50653fa" class="outline-3">
<h3 id="org50653fa"><span class="section-number-3">5.1.</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-orgd973ce7" class="outline-2">
<h2 id="orgd973ce7"><span class="section-number-2">6.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org1bff023" class="outline-3">
<h3 id="org1bff023"><span class="section-number-3">6.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org6e8dfee" class="outline-4">
<h4 id="org6e8dfee"><span class="section-number-4">6.1.1.</span> Started new audio tool program to replace aftools</h4>
</div>
</div>
</div>
<div id="outline-container-org2c136d5" class="outline-2">
<h2 id="org2c136d5"><span class="section-number-2">7.</span> i5 system</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgd32c1bf" class="outline-3">
<h3 id="orgd32c1bf"><span class="section-number-3">7.1.</span> delicate primes</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-org1989bc1" class="outline-4">
<h4 id="org1989bc1"><span class="section-number-4">7.1.1.</span> Verified 294001 is a delicate prime in base 10</h4>
</div>
<div id="outline-container-org4d59a53" class="outline-4">
<h4 id="org4d59a53"><span class="section-number-4">7.1.2.</span> Determined 294001 is delicate in bases 2 and 10 but not in bases 3-9,11-16</h4>
</div>
<div id="outline-container-org5907dc3" class="outline-4">
<h4 id="org5907dc3"><span class="section-number-4">7.1.3.</span> What is the smallest delicate prime N in <b>any</b> base 2..(N-1)?</h4>
<div class="outline-text-4" id="text-7-1-3">
<p>
Does this question even make sense?
</p>
</div>
</div>
</div>
<div id="outline-container-org62a7845" class="outline-3">
<h3 id="org62a7845"><span class="section-number-3">7.2.</span> i5-12600K CPU</h3>
</div>
<div id="outline-container-org0421e5a" class="outline-3">
<h3 id="org0421e5a"><span class="section-number-3">7.3.</span> 32GB DDR5 mem</h3>
</div>
<div id="outline-container-org6d20824" class="outline-3">
<h3 id="org6d20824"><span class="section-number-3">7.4.</span> 512GB SSD</h3>
</div>
<div id="outline-container-org89ae1d9" class="outline-3">
<h3 id="org89ae1d9"><span class="section-number-3">7.5.</span> AMD Radeon RX 6800 GPU</h3>
</div>
<div id="outline-container-orgac7eb57" class="outline-3">
<h3 id="orgac7eb57"><span class="section-number-3">7.6.</span> ~100 compute cores across all devices</h3>
<div class="outline-text-3" id="text-7-6">
<p>
Hopefully won't have to do this again for a while. This blows the
toy budget for the year.
</p>
</div>
</div>
</div>
<div id="outline-container-org23ec361" class="outline-2">
<h2 id="org23ec361"><span class="section-number-2">8.</span> More project ideas</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org97fa06c" class="outline-3">
<h3 id="org97fa06c"><span class="section-number-3">8.1.</span> Zuse Z3 simulation in Verilog</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Good excuse for floating point ALU design.
</p>
</div>
</div>
<div id="outline-container-org5cc6397" class="outline-3">
<h3 id="org5cc6397"><span class="section-number-3">8.2.</span> ENIAC simulation in verilog</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Probably too big a nut to chew.
</p>
</div>
</div>
<div id="outline-container-org8241490" class="outline-3">
<h3 id="org8241490"><span class="section-number-3">8.3.</span> GMPForth ports to SIMH, DYCyber targets</h3>
<div class="outline-text-3" id="text-8-3">
</div>
<div id="outline-container-org0391d2a" class="outline-4">
<h4 id="org0391d2a"><span class="section-number-4">8.3.1.</span> SIMH maybe some targets (vax)</h4>
</div>
<div id="outline-container-org197416b" class="outline-4">
<h4 id="org197416b"><span class="section-number-4">8.3.2.</span> DTCyber suboptimal due to data/addr word size mismatch</h4>
</div>
<div id="outline-container-orgdd3502e" class="outline-4">
<h4 id="orgdd3502e"><span class="section-number-4">8.3.3.</span> MAME looks interesting for microprocessor system emulations</h4>
<div class="outline-text-4" id="text-8-3-3">
<p>
How to support erzatz systems?
</p>
</div>
</div>
<div id="outline-container-orgadc3d03" class="outline-4">
<h4 id="orgadc3d03"><span class="section-number-4">8.3.4.</span> Ports to classic figFORTH targets</h4>
</div>
</div>
<div id="outline-container-org4171f45" class="outline-3">
<h3 id="org4171f45"><span class="section-number-3">8.4.</span> GMPASM assembler</h3>
<div class="outline-text-3" id="text-8-4">
<p>
May be useful for handbuilt systems.
</p>
</div>
</div>
</div>
<div id="outline-container-org32054c0" class="outline-2">
<h2 id="org32054c0"><span class="section-number-2">9.</span> David Davies</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgf4a8a75" class="outline-3">
<h3 id="orgf4a8a75"><span class="section-number-3">9.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-orgd5acc80" class="outline-3">
<h3 id="orgd5acc80"><span class="section-number-3">9.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org1e46a7e" class="outline-3">
<h3 id="org1e46a7e"><span class="section-number-3">9.3.</span> Next hearing 9/6/2022</h3>
</div>
</div>
<div id="outline-container-org12f40ee" class="outline-2">
<h2 id="org12f40ee"><span class="section-number-2">10.</span> Peter Kim</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgd51df3b" class="outline-3">
<h3 id="orgd51df3b"><span class="section-number-3">10.1.</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-org02ff282" class="outline-3">
<h3 id="org02ff282"><span class="section-number-3">10.2.</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-orgb2f49ca" class="outline-3">
<h3 id="orgb2f49ca"><span class="section-number-3">10.3.</span> Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</h3>
</div>
<div id="outline-container-org7a1f290" class="outline-3">
<h3 id="org7a1f290"><span class="section-number-3">10.4.</span> Sentencing 9/20/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2022-08-06 Sat 06:31</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
